# 2007. 競争条件コード
RACE_CONDITION = {
    "000": "",  # 未設定・未整備時の初期値(主に地方競馬・海外国際レースに関するデータ)
    "001": "100万円以下",
    "002": "200万円以下",
    "003": "300万円以下",
    "005": "500万円以下 １勝クラス",
    "010": "1000万円以下 ２勝クラス",
    "016": "1500万円以下 ３勝クラス",
    "099": "9900万円以下",
    "100": "1億円以下",
    "701": "新馬",
    "702": "未出走",
    "703": "未勝利",
    "999": "オープン",
}

# 2003. グレードコード
GRADE_CODE = {
    "A": "G1",
    "B": "G2",
    "C": "G3",
    "D": "重賞",
    "E": "特別競走",
    "F": "J・G1",
    "G": "J・G2",
    "H": "J・G3",
    "L": "リステッド"
}

# 2009.トラックコード
TRACK_CODE = {
    "00": "未設定",
    "10": "芝・直",
    "11": "芝・左",
    "12": "芝・左外",
    "13": "芝・左内→外",
    "14": "芝・左外→内",
    "15": "芝・左内2周",
    "16": "芝・左外2周",
    "17": "芝・右",
    "18": "芝・右外",
    "19": "芝・右内→外",
    "20": "芝・右外→内",
    "21": "芝・右内2周",
    "22": "芝・右外2周",
    "23": "ダート・左",
    "24": "ダート・右",
    "25": "ダート・左内",
    "26": "ダート・右外",
    "27": "サンド・左",
    "28": "サンド・右",
    "29": "ダート・直",
    "51": "障 芝・襷",
    "52": "障 芝→ダート",
    "53": "障 芝・左",
    "54": "障 芝",
    "55": "障 芝・外",
    "56": "障 芝・外→内",
    "57": "障 芝・内→外",
    "58": "障 芝・内2周",
    "59": "障 芝・外2周",
}

# 2202.性別コード
GENDER_CODE = {
    "0": "未設定",
    "1": "牡",
    "2": "牝",
    "3": "騙",
}